# final_project

Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

Описание работы каждой строки программы

string[] mass = new string[] {"Hi", "Non", "Private", "Pre"}; // Создали массив и наполнили элементами

int lenMass = mass.Length; // узнали количество элементов в массиве

string[] newMass = new string[lenMass]; //Создаём массив, размером как предыдущий, для дальнейшей записи в него уже нужных элементов

//Перебераем массив и записываем все элементы, 
//которые по длине меньше или равно 3 в новый массив
int len = 0; // переменная для подсчёта длины каждого элемента массива
for (int i = 0; i < lenMass; i++) // обходим все элементы массива
{
    len = mass[i].Length; // берем каждый элемент массива и узнаем длину
    if (len <= 3) // если условие (длина элемента массива меньше или равна 3 символам) выполняется
        newMass[i] += mass[i]; // записываем этот элемент в ранее созданный новый массив
}

//Выводим новый массив
int lenNewMass = newMass.Length;

for (int i = 0; i < lenNewMass; i++)
{
    System.Console.WriteLine(newMass[i]);
}
